Revit 2026 API

# MetalMetalPatternScale Property

---

The property labeled "Scale" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalPatternScale { get; }
```
```vb
Public Shared ReadOnly Property MetalPatternScale As String
	Get
```
```cpp
public:
static property String^ MetalPatternScale {
	String^ get ();
}
```
```fsharp
static member MetalPatternScale : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" with a minimum of "0".

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace